""" Задача 8: Напиши програма која прашува од корисникот да внесе низа од броеви сè додека не внесе негативен број. 
креирај функција која ќе го испечати го збирот на позитивните броеви што биле внесени."""

def lista_poz(lista_in):
    zbir = 0
    for i in lista_in:
        if i%2 == 0:
            zbir = zbir + i
    return zbir
        
lisa_vnes =[] 
cnt = 1   
while True:
    br = int(input(f'Внесете го {cnt} број (*за да завршите со внесување треба да внесете негативен број): '))
    if br >= 0:
        lisa_vnes.append(br)
        cnt+1
    if br < 0:
        break

print(f'Збирот на позитивните броеви од внесената листа е : {lista_poz(lisa_vnes)}')



