""" Задача 3: Напиши програма која го прашува корисникот да внесе број и го креирај функција која испишува збирот на
 сите броеви од 1 до внесениот број."""

def presmetaj_zbir(x):
    zbir = 0
    for i in range(1,x+1):
        zbir = zbir + i
    print(f'Збирот на броевите од 1 до {x} е {zbir}')

x = int(input('Внесте еден број:'))
presmetaj_zbir(x)