"""Задача 1: Напиши функција која прашува од корисникот да внесе својата возраст и испишува 
"Вие сте малолетни" ако возраста е помала од 18, а "Вие сте полнолетни" во спротивно."""

def polnoleten(x):
    if x < 18:
        print('Вие сте малолетни')
    else:
        print('Вие сте полнолетни')

x= int(input('Внесте колку години имате: '))
polnoleten(x)