""" Вежба 1: Напиши програма за печатење на броевите од 1 до 10."""
lista= []
for i in range(1,11):
    print(i)
    lista.append(i) ## ако сакаме да ги испринтаме како листа 
print(lista)

""" Вежба 2: Напиши програма за пресметување и печатење на збирот на сите броеви од 1 до 10."""

zbir = 0
for i in range(1,11):
    zbir = zbir + i
print(f'Вкупниот збир на броевите од  1 до 10 е {zbir}')

""" Вежба 3: Напиши програма за печатење на квадратите на броевите од 1 до 10."""

x = 1
lista = []
for i in range(1,11):
    x = i ** 2
    lista.append(x)
print(lista)
