""" Напишете програма која ќе прочита број од корисникот и ќе го провери дали тој е деллив со 3, 5, 3 и 5, 
     а потоа ќе испечати соодветната порака."""

x1 = int(input('Внесете еден цел број:'))

p_div3 = x1 % 3
p_div5 = x1 % 5

if p_div3 == 0 and p_div5 == 0:
    print(f'Бројот {x1} е делив со 3 и 5')
elif p_div3 == 0 and p_div5 != 0:
    print(f'Бројот {x1} е делев цамо со  3')
elif p_div3 != 0 and p_div5 == 0:
    print(f'Бројот {x1} е делев само со 5')
else:
    print(f'Бројот {x1} не е делив ни со 3 ни со 5')