""" Напишете програма која ќе прочита страни на правоаголник и квадрат,
 да се пресмета плоштината и да се провери дали збирот на плоштините е деллив со 2,3 или 5"""

p1 = int(input('Внесете ја должината на правоаголникот:'))
p2 = int(input('Внесете ја ширинат на правоаголникот:'))

k1 = int(input('Внесете ја должината на страната на квадратот:'))

P_pravoagolnik = p1*p2
p_kvadrat = k1**2

print(f'Плоштината на правоаголникот е {P_pravoagolnik}, а на квадратот {p_kvadrat}')

p_suma = P_pravoagolnik + p_kvadrat
p_div2 = p_suma%2
p_div3 = p_suma%3
p_div5 = p_suma%5

if p_div2 == 0:
    print(f'Сумата на плоштините на правоаголникот и квадратот која изнесува {p_suma}, е делива со 2')
elif  p_div3 == 0:  
    print(f'Сумата на плоштините на правоаголникот и квадратот која изнесува {p_suma}, е делива со 3')
elif  p_div5 == 0:
    print(f'Сумата на плоштините на правоаголникот и квадратот која изнесува {p_suma} , е делива со 5')
else:
    print(f'Сумата на плоштините на правоаголникот и квадратот која изнесува {p_suma}, не е делива со 2,3 и 5')    